import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:get/get_core/src/get_main.dart';

class PrayerScreen extends StatefulWidget {
  const PrayerScreen({super.key});

  @override
  State<PrayerScreen> createState() => _PrayerScreenState();
}

class _PrayerScreenState extends State<PrayerScreen> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xFF2E4A66),
        title: Row(
          children: const [
            SizedBox(width: 10),
            Expanded(
              child: Text(
                'கல்வாரி அன்பின் மனதுருக்கம் ஊழியங்கள்',
                style: TextStyle(color: Colors.white),
                overflow: TextOverflow.ellipsis,
              ),
            ),
          ],
        ),
        actions: [
          TextButton(
            onPressed: () {
              Navigator.pushNamed(context, '/about');
            },
            child: const Text('ABOUT', style: TextStyle(color: Colors.white)),
          ),
          TextButton(
            onPressed: () {
              Get.toNamed("/video");
            },
            child: const Text('VIDEO', style: TextStyle(color: Colors.white)),
          ),
          TextButton(
            onPressed: () {
              Get.toNamed("/prayer");
            },
            child: const Text('PRAYER', style: TextStyle(color: Colors.white)),
          ),
          TextButton(
            onPressed: () {
             Get.toNamed("/faq");
            },
            child: const Text('FAQ', style: TextStyle(color: Colors.white)),
          ),
          const SizedBox(width: 10),
        ],
      ),
      body: SingleChildScrollView(
        padding: const EdgeInsets.all(16.0),
        child: const Text(
          '''
இயேசு கற்பித்த ஜெபம்
நீங்கள் ஜெபம்பண்ணவேண்டிய விதமாவது; பரமண்டலங்களிலிருக்கிற எங்கள் பிதாவே, உம்முடைய நாமம் பரிசுத்தப்படுவதாக; உம்முடைய ராஜ்யம் வருவதாக; உம்முடைய சித்தம் பரமண்டலத்திலே செய்யப்படுகிறதுபோல பூமியிலேயும் செய்யப்படுவதாக. எங்களுக்கு வேண்டிய ஆகாரத்தை இன்று எங்களுக்குத் தாரும். எங்கள் கடனாளிகளுக்கு நாங்கள் மன்னிக்கிறதுபோல எங்கள் கடன்களை எங்களுக்கு மன்னியும். எங்களைச் சோதனைக்குட்படப்பண்ணாமல், தீமையினின்று எங்களை இரட்சித்துக்கொள்ளும், ராஜ்யமும், வல்லமையும், மகிமையும் என்றென்றைக்கும் உம்முடையவைகளே, ஆமென், என்பதே.
(மத்தேயு 6:9-13)

பாவ மன்னிப்பு கேட்டு ஜெபம்
கர்த்தாவே, உம்முடைய இரக்கங்களையும் உம்முடைய காருணியங்களையும் நினைத்தருளும், அவைகள் அநாதிகாலமுதல் இருக்கிறதே. என் இளவயதின் பாவங்களையும் என் மீறுதல்களையும் நினையாதிரும்; கர்த்தாவே, உம்முடைய தயவினிமித்தம் என்னை உமது கிருபையின்படியே நினைத்தருளும்.
(சங்கீதம் 25: 6-7)
என்மேல் நோக்கமாகி, எனக்கு இரங்கும்; நான் தனித்தவனும் சிறுமைப்படுகிறவனுமாயிருக்கிறேன். என் இருதயத்தின் வியாகுலங்கள் பெருகியிருக்கிறது; என் இடுக்கண்களுக்கு என்னை நீங்கலாக்கிவிடும். என் துன்பத்தையும் என் வருத்தத்தையும் பார்த்து, என் பாவங்களையெல்லாம் மன்னித்தருளும். என் சத்துருக்களைப் பாரும்; அவர்கள் பெருகியிருந்து, உக்கிரபகையாய் என்னைப் பகைக்கிறார்கள். என் ஆத்துமாவைக் காப்பாற்றி என்னை விடுவியும்; நான் வெட்கப்பட்டுப்போகாதபடி செய்யும்; உம்மை நம்பியிருக்கிறேன். உத்தமமும் நேர்மையும் என்னைக் காக்கக்கடவது; நான் உமக்குக் காத்திருக்கிறேன்.  தேவனே, இஸ்ரவேலை அவனுடைய எல்லா இக்கட்டுகளுக்கும் நீங்கலாக்கி மீட்டுவிடும்.
(சங்கீதம் 25: 16-22)
தேவனே, உமது கிருபையின்படி எனக்கு இரங்கும், உமது மிகுந்த இரக்கங்களின்படி என் மீறுதல்கள் நீங்க என்னைச் சுத்திகரியும். என் அக்கிரமம் நீங்க என்னை முற்றிலும் கழுவி, என் பாவமற என்னைச் சுத்திகரியும். என் மீறுதல்களை நான் அறிந்திருக்கிறேன்; என் பாவம் எப்பொழுதும் எனக்கு முன்பாக நிற்கிறது. தேவரீர் ஒருவருக்கே விரோதமாக நான் பாவஞ்செய்து, உமது கண்களுக்கு முன்பாகப் பொல்லாங்கானதை நடப்பித்தேன்; நீர் பேசும்போது உம்முடைய நீதி விளங்கவும், நீர் நியாயந்தீர்க்கும்போது உம்முடைய பரிசுத்தம் விளங்கவும் இதை அறிக்கையிடுகிறேன். இதோ, நான் துர்க்குணத்தில் உருவானேன்; என் தாய் என்னைப் பாவத்தில் கர்ப்பந்தரித்தாள். இதோ, உள்ளத்தில் உண்மையிருக்க விரும்புகிறீர்; அந்தக்கரணத்தில் ஞானத்தை எனக்குத் தெரியப்படுத்துவீர். நீர் என்னை ஈசோப்பினால் சுத்திகரியும், அப்பொழுது நான் சுத்தமாவேன்; என்னைக் கழுவியருளும், அப்பொழுது நான் உறைந்த மழையிலும் வெண்மையாவேன். நான் சந்தோஷமும் மகிழ்ச்சியும் கேட்கும்படி செய்யும், அப்பொழுது நீர் நொறுக்கின எலும்புகள் களிகூரும். என் பாவங்களைப் பாராதபடிக்கு நீர் உமது முகத்தை மறைத்து, என் அக்கிரமங்களையெல்லாம் நீக்கியருளும். தேவனே, சுத்த இருதயத்தை என்னிலே சிருஷ்டியும், நிலைவரமான ஆவியை என் உள்ளத்திலே புதுப்பியும். உமது சமுகத்தை விட்டு என்னைத் தள்ளாமலும், உமது பரிசுத்த ஆவியை என்னிடத்திலிருந்து எடுத்துக்கொள்ளாமலும் இரும். உமது இரட்சணியத்தின் சந்தோஷத்தைத் திரும்பவும் எனக்குத் தந்து, உற்சாகமான ஆவி என்னைத் தாங்கும்படி செய்யும். அப்பொழுது பாதகருக்கு உமது வழிகளை உபதேசிப்பேன்; பாவிகள் உம்மிடத்தில் மனந்திரும்புவார்கள். தேவனே, என்னை இரட்சிக்குந் தேவனே, இரத்தப்பழிகளுக்கு என்னை நீங்கலாக்கிவிடும்; அப்பொழுது என் நாவு உம்முடைய நீதியைக் கெம்பீரமாய்ப் பாடும். ஆண்டவரே, என் உதடுகளைத் திறந்தருளும்; அப்பொழுது என் வாய் உம்முடைய புகழை அறிவிக்கும். பலியை நீர் விரும்புகிறதில்லை, விரும்பினால் செலுத்துவேன்; தகனபலியும் உமக்குப் பிரியமானதல்ல. தேவனுக்கேற்கும் பலிகள் நொறுங்குண்ட ஆவிதான்; தேவனே, நொறுங்குண்டதும் நருங்குண்டதுமான இருதயத்தை நீர் புறக்கணியீர். சீயோனுக்கு உமது பிரியத்தின்படி நன்மைசெய்யும்; எருசலேமின் மதில்களைக் கட்டுவீராக. அப்பொழுது தகனபலியும் சர்வாங்க தகனபலியுமாகிய நீதியின்பலிகளில் பிரியப்படுவீர்; அப்பொழுது உமது பீடத்தின்மேல் காளைகளைப் பலியிடுவார்கள்.
(சங்கீதம் 51:1-19)
இயேசு தமது சீஷர்களுக்காக செய்த ஜெபம்
இயேசு இவைகளைச் சொன்ன பின்பு தம்முடைய கண்களை வானத்துக்கு ஏறெடுத்து: பிதாவே, வேளை வந்தது, நீர் உம்முடைய குமாரனுக்குத் தந்தருளின யாவருக்கும் அவர் நித்தியஜீவனைக் கொடுக்கும்பொருட்டு மாம்சமான யாவர்மேலும் நீர் அவருக்கு அதிகாரங்கொடுத்தபடியே, உம்முடைய குமாரன் உம்மை மகிமைப்படுத்தும்படிக்கு நீர் உம்முடைய குமாரனை மகிமைப்படுத்தும். ஒன்றான மெய்த்தேவனாகிய உம்மையும் நீர் அனுப்பினவராகிய இயேசுகிறிஸ்துவையும் அறிவதே நித்தியஜீவன். பூமியிலே நான் உம்மை மகிமைப்படுத்தினேன்; நான் செய்யும்படி நீர் எனக்கு நியமித்த கிரியையைச் செய்துமுடித்தேன். பிதாவே, உலகம் உண்டாகிறதற்கு முன்னே உம்மிடத்தில் எனக்கு உண்டாயிருந்த மகிமையினாலே இப்பொழுது நீர் என்னை உம்மிடத்திலே மகிமைப்படுத்தும். நீர் உலகத்தில் தெரிந்தெடுத்து எனக்குத் தந்த மனுஷருக்கு உம்முடைய நாமத்தை வெளிப்படுத்தினேன். அவர்கள் உம்முடையவர்களாயிருந்தார்கள், அவர்களை எனக்குத் தந்தீர், அவர்கள் உம்முடைய வசனத்தைக் கைக்கொண்டிருக்கிறார்கள்.  நீர் எனக்குத் தந்தவைகளெல்லாம் உம்மாலே உண்டாயினவென்று இப்பொழுது அறிந்திருக்கிறார்கள். நீர் எனக்குக் கொடுத்த வார்த்தைகளை நான் அவர்களுக்குக் கொடுத்தேன்; அவர்கள் அவைகளை ஏற்றுக்கொண்டு, நான் உம்மிடத்திலிருந்து புறப்பட்டுவந்தேன் என்று நிச்சயமாய் அறிந்து, நீர் என்னை அனுப்பினீர் என்று விசுவாசித்திருக்கிறார்கள். நான் அவர்களுக்காக வேண்டிக்கொள்ளுகிறேன்; உலகத்துக்காக வேண்டிக்கொள்ளாமல், நீர் எனக்குத் தந்தவர்களுக்காக வேண்டிக்கொள்ளுகிறேன்; அவர்கள் உம்முடையவர்களாயிருக்கிறார்களே. என்னுடையவைகள் யாவும் உம்முடையவைகள், உம்முடையவைகள் என்னுடையவைகள்; அவர்களில் நான் மகிமைப்பட்டிருக்கிறேன், நான் இனி உலகத்திலிரேன், இவர்கள் உலகத்திலிருக்கிறார்கள்; நான் உம்மிடத்திற்கு வருகிறேன். பரிசுத்த பிதாவே, நீர் எனக்குத் தந்தவர்கள் நம்மைப்போல ஒன்றாயிருக்கும்படிக்கு, நீர் அவர்களை உம்முடைய நாமத்தினாலே காத்துக்கொள்ளும். நான் அவர்களுடனேகூட உலகத்திலிருக்கையில் அவர்களை உம்முடைய நாமத்தினாலே காத்துக்கொண்டேன்; நீர் எனக்குத் தந்தவர்களைக் காத்துக்கொண்டுவந்தேன்; வேதவாக்கியம் நிறைவேறத்தக்கதாக, கேட்டின் மகன் கெட்டுப்போனானேயல்லாமல், அவர்களில் ஒருவனும் கெட்டுப்போகவில்லை. இப்பொழுது நான் உம்மிடத்திற்கு வருகிறேன்; அவர்கள் என் சந்தோஷத்தை நிறைவாய் அடையும்படி உலகத்தில் இருக்கையில் இவைகளைச் சொல்லுகிறேன். நான் உம்முடைய வார்த்தையை அவர்களுக்குக் கொடுத்தேன்; நான் உலகத்தானல்லாததுபோல அவர்களும் உலகத்தாரல்ல; ஆதலால் உலகம் அவர்களைப் பகைத்தது. நீர் அவர்களை உலகத்திலிருந்து எடுத்துக்கொள்ளும்படி நான் வேண்டிக்கொள்ளாமல், நீர் அவர்களைத் தீமையினின்று காக்கும்படி வேண்டிக்கொள்ளுகிறேன். நான் உலகத்தானல்லாததுபோல, அவர்களும் உலகத்தாரல்ல. உம்முடைய சத்தியத்தினாலே அவர்களைப் பரிசுத்தமாக்கும்; உம்முடைய வசனமே சத்தியம். நீர் என்னை உலகத்தில் அனுப்பினதுபோல, நானும் அவர்களை உலகத்தில் அனுப்புகிறேன். அவர்களும் சத்தியத்தினாலே பரிசுத்தமாக்கப்பட்டவர்களாகும்படி, அவர்களுக்காக நான் என்னைத்தானே பரிசுத்தமாக்குகிறேன். நான் இவர்களுக்காக வேண்டிக்கொள்ளுகிறதுமல்லாமல், இவர்களுடைய வார்த்தையினால் என்னை விசுவாசிக்கிறவர்களுக்காகவும் வேண்டிக்கொள்ளுகிறேன். அவர்களெல்லாரும் ஒன்றாயிருக்கவும், பிதாவே, நீர் என்னை அனுப்பினதை உலகம் விசுவாசிக்கிறதற்காக, நீர் என்னிலேயும் நான் உம்மிலேயும் இருக்கிறதுபோல அவர்களெல்லாரும் நம்மில் ஒன்றாயிருக்கவும் வேண்டிக்கொள்ளுகிறேன். நாம் ஒன்றாயிருக்கிறதுபோல அவர்களும் ஒன்றாயிருக்கும்படி நீர் எனக்குத்தந்த மகிமையை நான் அவர்களுக்குக் கொடுத்தேன். ஒருமைப்பாட்டில் அவர்கள் தேறினவர்களாயிருக்கும்படிக்கும், என்னை நீர் அனுப்பினதையும், நீர் என்னில் அன்பாயிருக்கிறதுபோல அவர்களிலும் அன்பாயிருக்கிறதையும் உலகம் அறியும்படிக்கும், நான் அவர்களிலும் நீர் என்னிலும் இருக்கும்படி வேண்டிக்கொள்ளுகிறேன். பிதாவே, உலகத்தோற்றத்துக்கு முன் நீர் என்னில் அன்பாயிருந்தபடியினால், நீர் எனக்குத் தந்த என்னுடைய மகிமையை நீர் எனக்குத் தந்தவர்கள் காணும்படியாக, நான் எங்கே இருக்கிறேனோ அங்கே அவர்களும் என்னுடனேகூட இருக்க விரும்புகிறேன். நீதியுள்ள பிதாவே, உலகம் உம்மை அறியவில்லை, நான் உம்மை அறிந்திருக்கிறேன்; நீர் என்னை அனுப்பினதை இவர்களும் அறிந்திருக்கிறார்கள். நீர் என்னிடத்தில் வைத்த அன்பு அவர்களிடத்திலிருக்கும்படிக்கும், நானும் அவர்களிலிருக்கும்படிக்கும், உம்முடைய நாமத்தை அவர்களுக்குத் தெரியப்படுத்தினேன்; இன்னமும் தெரியப்படுத்துவேன் என்றார்.
(யோவான் 17:1-26)



          style: TextStyle(color: Colors.black, fontSize: 15),
          textAlign: TextAlign.start,
        ),
      ),
    );
  }
}
