import 'package:flutter/material.dart';
import 'package:get/get.dart';
import '../Commonfile/assets.dart';
import 'homepage _widgets.dart';

class Homepage extends StatelessWidget {
  const Homepage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xFF2E4A66),
        title: const Row(
          children: [
            SizedBox(width: 10),
            Expanded(
              child: Text(
                'கல்வாரி அன்பின் மனதுருக்கம் ஊழியங்கள்',
                style: TextStyle(color: Colors.white),
                overflow: TextOverflow.ellipsis,
              ),
            ),
          ],
        ),
        actions: [
          TextButton(
            onPressed: () {
              Navigator.pushNamed(context, '/about');
            },
            child: const Text('About', style: TextStyle(color: Colors.white)),
          ),
          TextButton(
            onPressed: () {
              Get.toNamed("/video");
            },
            child: const Text('Videos', style: TextStyle(color: Colors.white)),
          ),
          TextButton(
            onPressed: () {
              Get.toNamed("/prayer");
            },
            child: const Text('Prayers', style: TextStyle(color: Colors.white)),
          ),
          TextButton(
            onPressed: () {
              Get.toNamed("/children");
            },
            child: const Text('For Children', style: TextStyle(color: Colors.white)),
          ),TextButton(
            onPressed: () {
              Get.toNamed("/faq");
            },
            child: const Text('FAQs', style: TextStyle(color: Colors.white)),
          ),
          const SizedBox(width: 10),
        ],
      ),
      body: SingleChildScrollView(
        child: Center(
          child: Column(
            mainAxisAlignment: MainAxisAlignment.center,
            children: [
              Image.asset(david),
              const SizedBox(height: 40),
              const Text(
                "இயேசுவின் அன்பை ஒன்றாக அனுபவியுங்கள்",
                style: TextStyle(
                    fontSize: 25,
                    color: Colors.black,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(height: 25),
              const Text(
                "இறைவனுடைய அன்பு நம் இருதயங்களில் பரிசுத்த ஆவியினால் ஊற்றப்பட்டுள்ளது.",
                style: TextStyle(fontSize: 18, color: Colors.lightBlue),
              ),
              const SizedBox(height: 15),
              const Padding(
                padding: EdgeInsets.symmetric(horizontal: 16.0),
                child: Text(
                  "இயேசுவின் அன்பு என்பது மனித மனதை மாற்றும் தெய்வீக சக்தியாகும்... "
                      "இந்த அன்பு தனிமையில் வாழ்வதற்காக அல்ல, ஒருமையாக வாழ அனைவரையும் அழைக்கும் அழைப்பாகும். இறைவனுடைய இருதயத்திற்கு ஏற்றவிதத்தில் நாம் வாழும்படி இயேசு கற்பித்தார். இயேசுவின் வார்த்தைகளின் படி செய்வதே நம் வாழ்வின் நோக்கமாக இருக்க வேண்டும்.",
                  style: TextStyle(color: Colors.black, fontSize: 15),
                  textAlign: TextAlign.justify,
                ),
              ),
              const SizedBox(height: 25),
              const Text(
                "தேவனுடைய இதயத்திற்கு ஏற்றவன் – தாவீதின் பயணம்.",
                style: TextStyle(fontSize: 18, color: Colors.lightBlue),
              ),
              const Padding(
                padding: EdgeInsets.symmetric(horizontal: 16.0),
                child: Text(
                  "ஈசாயின் பன்னிரண்டு மகன்களில் தாவீது இளையவன். ஒருநாள், போருக்குத் திரண்டிருந்த பெலிஸ்தரின் படையோடு யுத்தம் செய்ய இஸ்ரவேல் தேசத்தார் அழைக்கப்பட்டார்கள். தாவீதின் சகோதரர்கள் யுத்தம் செய்யச் சென்றபோது, இளைஞனான தாவீது அங்கேயே தங்கிவிட்டார். இரு படைகளும் ஒன்று திரண்டு ஒரு ஆழமான பள்ளத்தாக்கின் எதிரெதிர் பக்கங்களில் நின்றன. ஒன்பது அடி உயரத்தில் நின்ற கோலியாத் என்ற பெரிய பெலிஸ்திய ராட்சதன், நாற்பது நாட்கள் ஒவ்வொரு நாளும் பெலிஸ்தியரின் யுத்தம் முனைக்கு வந்து இஸ்ரவேலரையும் அவர்களின் கடவுளையும் கேலி செய்தான். கோலியாத் அவர்களை போருக்கு அழைத்தான், ஆனால் சவுல் ராஜாவும் இஸ்ரவேலர்களும் பயந்து ஒன்றும் செய்யவில்லை தாவீது ஒரு நல்ல இசைக் கலைஞராய், கவிஞராய் மற்றும் தேவனுடைய இதயத்திற்கு ஏற்ற மனிதன் என அழைக்கப்பட்டவர்",
                  style: TextStyle(color: Colors.black, fontSize: 15),
                  textAlign: TextAlign.justify,
                ),
              ),
              const SizedBox(height: 25),
              const Text(
                "தாவீது கோலியாத்தை வென்ற கதை",
                style: TextStyle(color: Colors.blue, fontSize: 18),
              ),
              const SizedBox(height: 15),
              const Padding(
                padding: EdgeInsets.symmetric(horizontal: 16.0),
                child: Text(
                  "தாவீது சவுலை நோக்கி: இவனிமித்தம் ஒருவனுடைய இருதயமும் கலங்க வேண்டியதில்லை; உம்முடைய அடியானாகிய நான் போய், இந்தப் பெலிஸ்தனோடே யுத்தம்பண்ணுவேன் என்றான். அப்பொழுது சவுல் தாவீதை நோக்கி: நீ இந்தப் பெலிஸ்தனோடே எதிர்த்து யுத்தம்பண்ண உன்னால் ஆகாது; நீ இளைஞன், அவனோ தன் சிறுவயதுமுதல் யுத்தவீரன் என்றான். தாவீது சவுலைப்பார்த்து: உம்முடைய அடியான் என் தகப்பனுடைய ஆடுகளை மேய்த்துக்கொண்டிருக்கிறபோது, ஒருவிசை ஒரு சிங்கமும், ஒருவிசை ஒரு கரடியும் வந்து, மந்தையிலிருக்கிற ஒரு ஆட்டைப் பிடித்துக்கொண்டது. நான் அதைத் தொடர்ந்துபோய், அதை அடித்து, அதை அதின் வாய்க்குத் தப்புவித்தேன்; அது என்மேல் பாய்ந்தபோது, நான் அதின் தாடியைப் பிடித்து, அதை அடித்துக் கொன்றுபோட்டேன். அந்தச் சிங்கத்தையும் அந்தக் கரடியையும் உம்முடைய அடியானாகிய நான் கொன்றேன்; விருத்தசேதனமில்லாத இந்தப் பெலிஸ்தனும் அவைகளில் ஒன்றைப்போல இருப்பான்; அவன் ஜீவனுள்ள தேவனுடைய சேனைகளை நிந்தித்தானே என்றான். பின்னும் தாவீது: என்னைச் சிங்கத்தின் கைக்கும் கரடியின் கைக்கும் தப்புவித்த கர்த்தர் இந்தப் பெலிஸ்தனுடைய கைக்கும் தப்புவிப்பார் என்றான்; அப்பொழுது சவுல் தாவீதைப் பார்த்து: போ, கர்த்தர் உன்னுடனேகூட இருப்பாராக என்றான். சவுல் தாவீதுக்குத் தன் வஸ்திரங்களை உடுத்துவித்து வெண்கலமான ஒரு சீராவை அவன் தலையின்மேல் போட்டு, ஒரு கவசத்தையும் அவனுக்குத் தரிப்பித்தான். அவனுடைய பட்டயத்தை தாவீது தன் வஸ்திரங்கள்மேல் கட்டிக்கொண்டு, அதிலே அவனுக்குப் பழக்கமில்லாததினால் நடந்துபார்த்தான்; அப்பொழுது தாவீது சவுலை நோக்கி: நான் இவைகளைப் போட்டுக்கொண்டு போகக்கூடாது; இந்த அப்பியாசம் எனக்கு இல்லை என்று சொல்லி, அவைகளைக் களைந்துபோட்டு, தன் தடியைக் கையிலே பிடித்துக்கொண்டு, ஆற்றிலிருக்கிற ஐந்து கூழாங்கல்லுகளைத் தெரிந்தெடுத்து, அவைகளை மேய்ப்பருக்குரிய தன்னுடைய அடைப்பப்பையிலே போட்டு, தன் கவணைத் தன் கையிலே பிடித்துக்கொண்டு, அந்தப் பெலிஸ்தனண்டையிலே போனான். பெலிஸ்தனும் நடந்து, தாவீதண்டைக்குக் கிட்டிவந்தான்; பரிசையைப் பிடிக்கிறவன் அவனுக்கு முன்னாக நடந்தான்.              பெலிஸ்தன் சுற்றிப்பார்த்து: தாவீதைக் கண்டு, அவன் இளைஞனும் சவுந்தரிய ரூபமான சிவந்த மேனியுள்ளவனுமாயிருந்தபடியினால், அவனை அசட்டைபண்ணினான். பெலிஸ்தன் தாவீதைப் பார்த்து: நீ தடிகளோடே என்னிடத்தில் வர நான் நாயா என்று சொல்லி, அவன் தன் தேவர்களைக்கொண்டு தாவீதைச் சபித்தான்.பின்னும் அந்தப் பெலிஸ்தன் தாவீதைப் பார்த்து: என்னிடத்தில் வா; நான் உன் மாம்சத்தை ஆகாயத்துப் பறவைகளுக்கும் காட்டு மிருகங்களுக்கும் கொடுப்பேன் என்றான். அதற்குத் தாவீது: பெலிஸ்தனை நோக்கி: நீ பட்டயத்தோடும், ஈட்டியோடும், கேடகத்தோடும் என்னிடத்தில் வருகிறாய்; நானோ நீ நிந்தித்த இஸ்ரவேலுடைய இராணுவங்களின் தேவனாகிய சேனைகளுடைய கர்த்தரின் நாமத்திலே உன்னிடத்தில் வருகிறேன். இன்றையதினம் கர்த்தர் உன்னை என் கையில் ஒப்புக்கொடுப்பார்; நான் உன்னைக் கொன்று, உன் தலையை உன்னை விட்டு வாங்கி, பெலிஸ்தருடைய பாளயத்தின் பிணங்களை இன்றையதினம் ஆகாயத்துப் பறவைகளுக்கும், பூமியின் காட்டு மிருகங்களுக்கும் கொடுப்பேன்; அதனால் இஸ்ரவேலில் தேவன் ஒருவர் உண்டு என்று பூலோகத்தார் எல்லாரும் அறிந்துகொள்ளுவார்கள். கர்த்தர் பட்டயத்தினாலும் ஈட்டியினாலும் ரட்சிக்கிறவர் அல்ல என்று இந்த ஜனக்கூட்டமெல்லாம் அறிந்துகொள்ளும்; யுத்தம் கர்த்தருடையது; அவர் உங்களை எங்கள் கையில் ஒப்புக்கொடுப்பார் என்றான். அப்பொழுது அந்தப் பெலிஸ்தன் எழும்பி, தாவீதுக்கு எதிராகக் கிட்டிவருகையில், தாவீது தீவிரமாய் அந்தச் சேனைக்கும் அந்தப் பெலிஸ்தனுக்கும் எதிராக ஓடி, தன் கையை அடைப்பத்திலே போட்டு, அதிலிருந்து ஒரு கல்லை எடுத்து, கவணிலே வைத்துச் சுழற்றி, பெலிஸ்தனுடைய நெற்றியிலே பட எறிந்தான்; அந்தக் கல் அவன் நெற்றியில் பதிந்து போனதினால், அவன் தரையிலே முகங்குப்புற விழுந்தான். இவ்விதமாகத் தாவீது ஒரு கவணினாலும் ஒரு கல்லினாலும் பெலிஸ்தனை மேற்கொண்டு, அவனை மடங்கடித்து, அவனைக் கொன்றுபோட்டான்; தாவீதின் கையில் பட்டயம் இல்லாதிருந்தது. - 1 சாமுவேல் 17:32-50",
                        style: TextStyle(color: Colors.black, fontSize: 15),
                  textAlign: TextAlign.justify,
                ),

              ),
              const SizedBox(height: 15),
              const Padding(
                padding: EdgeInsets.symmetric(horizontal: 16.0),
                child: Text(
                  "நாமும் கூட பல சமயங்களில் நம்மை மிரட்டும் பிரச்சனைகளைக் கண்டு பயப்படாமல் துணிந்து கர்த்தர் மேல் நம்பிக்கை வைத்து நமது பிரச்சனைகளை வீழ்த்த முடியும்.",
                  style: TextStyle(color: Colors.black, fontSize: 15),
                  textAlign: TextAlign.justify,
                ),

              ),
              const SizedBox(height: 30),
              Image.asset(subhashini),
              const SizedBox(height: 40),
              WebsiteFooter(),
            ],
          ),
        ),
      ),
    );
  }
}
