import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:get/get_core/src/get_main.dart';

class FaqScreen extends StatefulWidget {
  const FaqScreen({super.key});

  @override
  State<FaqScreen> createState() => _FaqScreenState();
}

class _FaqScreenState extends State<FaqScreen> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xFF2E4A66),
        title: Row(
          children: const [
            SizedBox(width: 10),
            Expanded(
              child: Text(
                'கல்வாரி அன்பின் மனதுருக்கம் ஊழியங்கள்',
                style: TextStyle(color: Colors.white),
                overflow: TextOverflow.ellipsis,
              ),
            ),
          ],
        ),
        actions: [
          TextButton(
            onPressed: () {
              Navigator.pushNamed(context, '/about');
            },
            child: const Text('ABOUT', style: TextStyle(color: Colors.white)),
          ),
          TextButton(
            onPressed: () {
              Get.toNamed("/video");
            },
            child: const Text('VIDEO', style: TextStyle(color: Colors.white)),
          ),
          TextButton(
            onPressed: () {
              Get.toNamed("/prayer");
            },
            child: const Text('PRAYER', style: TextStyle(color: Colors.white)),
          ),
          TextButton(
            onPressed: () {
Get.toNamed("/faq")     ;       },
            child: const Text('FAQ', style: TextStyle(color: Colors.white)),
          ),
          const SizedBox(width: 10),
        ],
      ),
      body: SingleChildScrollView(
        padding: const EdgeInsets.all(16.0),
        child: const Text(
          '''
இயேசு கற்பித்த ஜெபம்
நீங்கள் ஜெபம்பண்ணவேண்டிய விதமாவது; பரமண்டலங்களிலிருக்கிற எங்கள் பிதாவே, உம்முடைய நாமம் பரிசுத்தப்படுவதாக; உம்முடைய ராஜ்யம் வருவதாக; உம்முடைய சித்தம் பரமண்டலத்திலே செய்யப்படுகிறதுபோல பூமியிலேயும் செய்யப்படுவதாக. எங்களுக்கு வேண்டிய ஆகாரத்தை இன்று எங்களுக்குத் தாரும். எங்கள் கடனாளிகளுக்கு நாங்கள் மன்னிக்கிறதுபோல எங்கள் கடன்களை எங்களுக்கு மன்னியும். எங்களைச் சோதனைக்குட்படப்பண்ணாமல், தீமையினின்று எங்களை இரட்சித்துக்கொள்ளும், ராஜ்யமும், வல்லமையும், மகிமையும் என்றென்றைக்கும் உம்முடையவைகளே, ஆமென், என்பதே.
(மத்தேயு 6:9-13)

பாவ மன்னிப்பு கேட்டு ஜெபம்
கர்த்தாவே, உம்முடைய இரக்கங்களையும் உம்முடைய காருணியங்களையும் நினைத்தருளும், அவைகள் அநாதிகாலமுதல் இருக்கிறதே. என் இளவயதின் பாவங்களையும் என் மீறுதல்களையும் நினையாதிரும்; கர்த்தாவே, உம்முடைய தயவினிமித்தம் என்னை உமது கிருபையின்படியே நினைத்தருளும்.
(சங்கீதம் 25: 6-7)
என்மேல் நோக்கமாகி, எனக்கு இரங்கும்; நான் தனித்தவனும் சிறுமைப்படுகிறவனுமாயிருக்கிறேன். என் இருதயத்தின் வியாகுலங்கள் பெருகியிருக்கிறது; என் இடுக்கண்களுக்கு என்னை நீங்கலாக்கிவிடும். என் துன்பத்தையும் என் வருத்தத்தையும் பார்த்து, என் பாவங்களையெல்லாம் மன்னித்தருளும். என் சத்துருக்களைப் பாரும்; அவர்கள் பெருகியிருந்து, உக்கிரபகையாய் என்னைப் பகைக்கிறார்கள். என் ஆத்துமாவைக் காப்பாற்றி என்னை விடுவியும்; நான் வெட்கப்பட்டுப்போகாதபடி செய்யும்; உம்மை நம்பியிருக்கிறேன். உத்தமமும் நேர்மையும் என்னைக் காக்கக்கடவது; நான் உமக்குக் காத்திருக்கிறேன்.  தேவனே, இஸ்ரவேலை அவனுடைய எல்லா இக்கட்டுகளுக்கும் நீங்கலாக்கி மீட்டுவிடும்.
(சங்கீதம் 25: 16-22)

தேவனே, உமது கிருபையின்படி எனக்கு இரங்கும், உமது மிகுந்த இரக்கங்களின்படி என் மீறுதல்கள் நீங்க என்னைச் சுத்திகரியும். என் அக்கிரமம் நீங்க என்னை முற்றிலும் கழுவி, என் பாவமற என்னைச் சுத்திகரியும். என் மீறுதல்களை நான் அறிந்திருக்கிறேன்; என் பாவம் எப்பொழுதும் எனக்கு முன்பாக நிற்கிறது. தேவரீர் ஒருவருக்கே விரோதமாக நான் பாவஞ்செய்து, உமது கண்களுக்கு முன்பாகப் பொல்லாங்கானதை நடப்பித்தேன்; நீர் பேசும்போது உம்முடைய நீதி விளங்கவும், நீர் நியாயந்தீர்க்கும்போது உம்முடைய பரிசுத்தம் விளங்கவும் இதை அறிக்கையிடுகிறேன். இதோ, நான் துர்க்குணத்தில் உருவானேன்; என் தாய் என்னைப் பாவத்தில் கர்ப்பந்தரித்தாள். இதோ, உள்ளத்தில் உண்மையிருக்க விரும்புகிறீர்; அந்தக்கரணத்தில் ஞானத்தை எனக்குத் தெரியப்படுத்துவீர். நீர் என்னை ஈசோப்பினால் சுத்திகரியும், அப்பொழுது நான் சுத்தமாவேன்; என்னைக் கழுவியருளும், அப்பொழுது நான் உறைந்த மழையிலும் வெண்மையாவேன். நான் சந்தோஷமும் மகிழ்ச்சியும் கேட்கும்படி செய்யும், அப்பொழுது நீர் நொறுக்கின எலும்புகள் களிகூரும். என் பாவங்களைப் பாராதபடிக்கு நீர் உமது முகத்தை மறைத்து, என் அக்கிரமங்களையெல்லாம் நீக்கியருளும். தேவனே, சுத்த இருதயத்தை என்னிலே சிருஷ்டியும், நிலைவரமான ஆவியை என் உள்ளத்திலே புதுப்பியும். உமது சமுகத்தை விட்டு என்னைத் தள்ளாமலும், உமது பரிசுத்த ஆவியை என்னிடத்திலிருந்து எடுத்துக்கொள்ளாமலும் இரும். உமது இரட்சணியத்தின் சந்தோஷத்தைத் திரும்பவும் எனக்குத் தந்து, உற்சாகமான ஆவி என்னைத் தாங்கும்படி செய்யும். அப்பொழுது பாதகருக்கு உமது வழிகளை உபதேசிப்பேன்; பாவிகள் உம்மிடத்தில் மனந்திரும்புவார்கள். தேவனே, என்னை இரட்சிக்குந் தேவனே, இரத்தப்பழிகளுக்கு என்னை நீங்கலாக்கிவிடும்; அப்பொழுது என் நாவு உம்முடைய நீதியைக் கெம்பீரமாய்ப் பாடும். ஆண்டவரே, என் உதடுகளைத் திறந்தருளும்; அப்பொழுது என் வாய் உம்முடைய புகழை அறிவிக்கும். பலியை நீர் விரும்புகிறதில்லை, விரும்பினால் செலுத்துவேன்; தகனபலியும் உமக்குப் பிரியமானதல்ல. தேவனுக்கேற்கும் பலிகள் நொறுங்குண்ட ஆவிதான்; தேவனே, நொறுங்குண்டதும் நருங்குண்டதுமான இருதயத்தை நீர் புறக்கணியீர். சீயோனுக்கு உமது பிரியத்தின்படி நன்மைசெய்யும்; எருசலேமின் மதில்களைக் கட்டுவீராக. அப்பொழுது தகனபலியும் சர்வாங்க தகனபலியுமாகிய நீதியின்பலிகளில் பிரியப்படுவீர்; அப்பொழுது உமது பீடத்தின்மேல் காளைகளைப் பலியிடுவார்கள்.
(சங்கீதம் 51:1-19)
''',
          style: TextStyle(color: Colors.black, fontSize: 15),
          textAlign: TextAlign.start,
        ),
      ),
    );
  }
}
